# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`

In [2]:
# your answer here
employee = pd.read_csv(r"C:\Users\chiin\Desktop\Ironhack\Laboratorios\5.1-lab_pivot_table_and_correlation\your_code\Employee.csv")

employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [3]:
employee.shape

(9, 7)

#### What's the mean salary by department. 
##### Tip : There are 2 ways to do it - one way is with and the other way is without pivot tables. Do it both ways.

In [4]:
# your answer 
employee.pivot_table(index=["Department"]).head()

C:\Users\chiin\AppData\Local\Temp\ipykernel_4432\1347512940.py:2: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  employee.pivot_table(index=["Department"]).head()

            Salary     Years
Department
HR           45.00  4.666667
IT           48.75  4.500000
Sales        55.00  2.500000

In [5]:
# your answer 
employee.groupby('Department')['Salary'].mean()

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title

In [6]:
# your answer here
employee.pivot_table(index=["Department", "Title"], values = 'Salary',).head()

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [7]:
# your answer here
employee.pivot_table(index= ('Title'), values = ['Years','Salary'], aggfunc='mean').head()

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title

In [8]:
# your answer here
employee.pivot_table(index = ['Department', 'Title'], values='Salary', aggfunc=['mean', 'count'])

                       mean  count
                     Salary Salary
Department Title
HR         VP          70.0      1
           analyst     32.5      2
IT         VP          70.0      1
           analyst     32.5      2
           associate   60.0      1
Sales      associate   55.0      2

In [9]:
employee.groupby(['Department', 'Title'])['Salary'].agg(['mean', 'count'])

                      mean  count
Department Title
HR         VP         70.0      1
           analyst    32.5      2
IT         VP         70.0      1
           analyst    32.5      2
           associate  60.0      1
Sales      associate  55.0      2

#### We want to know for each department and for each job title the Salary's median,minimum,maximum and standard deviation. Comment your results

In [10]:
# your answer here
employee.pivot_table(index = ['Department', 'Title'], values='Salary', aggfunc=['median','min','max','std'])

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

In [11]:
a = employee.groupby(['Department', 'Title'])['Salary'].agg(['median', 'min', 'max', 'std'])

a

                      median  min  max       std
Department Title
HR         VP           70.0   70   70       NaN
           analyst      32.5   30   35  3.535534
IT         VP           70.0   70   70       NaN
           analyst      32.5   30   35  3.535534
           associate    60.0   60   60       NaN
Sales      associate    55.0   55   55  0.000000

#### Based on your comments, fill the missing values with an appropriate value

In [12]:
# your answer here
a = a.fillna(0)

a

                      median  min  max       std
Department Title
HR         VP           70.0   70   70  0.000000
           analyst      32.5   30   35  3.535534
IT         VP           70.0   70   70  0.000000
           analyst      32.5   30   35  3.535534
           associate    60.0   60   60  0.000000
Sales      associate    55.0   55   55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [39]:
# your answer here
employee.pivot_table(index = ['Department'], values='Salary', aggfunc=['count','sum'])

            count    sum
           Salary Salary
Department
HR              3    135
IT              4    195
Sales           2    110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary

In [41]:
# your answer here
employee.groupby(['Department', 'Title']).agg({'Years': 'sum', 'Salary': 'mean'})

                      Years  Salary
Department Title
HR         VP             8    70.0
           analyst        6    32.5
IT         VP             8    70.0
           analyst        3    32.5
           associate      7    60.0
Sales      associate      5    55.0

#### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table

#### * Hint: Write a custom function*

In [15]:
# your answer here

In [16]:
# your answer here

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`

In [17]:
# your answer here

#### Explore you dataset in terms of data types and descriptive statistics
#### *Hint: Use Pandas functions from previous lectures*

In [18]:
# your answer here

In [19]:
# your answer here

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [20]:
# your answer here

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [21]:
# your answer here

#### What can you say about Minute Very Active and Steps? Write a comment below

In [22]:
# your comment here

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [23]:
# your answer here

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [24]:
# your answer here

In [25]:
# Your comment here

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [26]:
# your answer here

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [27]:
# your answer here

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [28]:
# your answer here

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [29]:
# your answer here

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`

In [30]:
# your answer here

#### Show visually the frequency distribution of the time_grades dataset.

In [31]:
# your answer here

#### Is there a correaltion between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [32]:
# your answer

In [33]:
## your answer

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [34]:
# your answer here

In [35]:
#your comment here

#### Could you explain the difference between Pearson and Spearman correlation? (see References in README.md)

In [36]:
#your comment here